test4.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-4" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:Username>drmws</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Welcome1</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
        <AppParameters xmlns="http://drm.webservices.epm.oracle">
            <serverUrl>http://localhost:5240/Oracle/Drm/APIAdapter</serverUrl>
            <sessionParams>ProductVersion=11.1.2,CultureName=en-US,TimeZoneOffset=-3</sessionParams>
        </AppParameters>
    </soap:Header>
    <soap:Body xmlns:drm="http://drm.webservices.epm.oracle">
        <drm:addNode>
            <drm:versionName>${strversionname}</drm:versionName>
            <drm:hierName>${strhiername}</drm:hierName>
            <drm:parentName>${strparname}</drm:parentName>
            <drm:nodeName>${strnodename}</drm:nodeName>
            <drm:nodeDescription>${strnodedescr}</drm:nodeDescription>
            <drm:propNameValueList>
                <!--Zero or more repetitions:-->
                <drm:nv>
                    <drm:n>${strproperty}</drm:n>
                    <!--Optional:-->
                    <drm:v>${strpropertyvalue}</drm:v>
                </drm:nv>

            </drm:propNameValueList>

            <drm:updateIfExists>false</drm:updateIfExists>
        </drm:addNode>
    </soap:Body>
</soap:Envelope>